<?php
######## Генерирование ссылок ЧПУ #########
	####### Human Friendly URL #######
	######### designed by MSS ########
###########################################
class Hfu {
	public $external_string;
	//public $hfu_string; //готовый ЧПУ url
	
	/**
 * function __construct($string){
 * 		$this->external_string = $string;
 * 		$this->hfu_string = self::hfu_gen();
 * 		//echo $url.'<br>';
 * 	}
 */
	
	public function hfu_gen($string) {

	######## принцип работы strtr: #########
	/*
	echo strtr("baab", "ab", "01"),"\n";
	$trans = array("ab" => "01");
	echo strtr("baab", $trans);
	
	Результат выполнения данного примера:
	1001
	ba01
	########################################
	*/
	
	//транслитерация (любая кодировка)
	$this->external_string = $string;
	//$string = $this->external_string;
	//$this->hfu_string = self::hfu_gen($string);

	$converter = array (
	 
	'а' => 'a', 'б' => 'b', 'в' => 'v', 'г' => 'g', 'д' => 'd', 'е' => 'e',
	 
	'ё' => 'e', 'ж' => 'zh', 'з' => 'z', 'и' => 'i', 'й' => 'y', 'к' => 'k',
	 
	'л' => 'l', 'м' => 'm', 'н' => 'n', 'о' => 'o', 'п' => 'p', 'р' => 'r',
	 
	'с' => 's', 'т' => 't', 'у' => 'u', 'ф' => 'f', 'х' => 'h', 'ц' => 'c',
	 
	'ч' => 'ch', 'ш' => 'sh', 'щ' => 'sch', 'ь' => '', 'ы' => 'y', 'ъ' => '',
	 
	'э' => 'e', 'ю' => 'yu', 'я' => 'ya', 'А' => 'A', 'Б' => 'B', 'В' => 'V',
	 
	'Г' => 'G', 'Д' => 'D', 'Е' => 'E', 'Ё' => 'E', 'Ж' => 'Zh', 'З' => 'Z',
	 
	'И' => 'I', 'Й' => 'Y', 'К' => 'K', 'Л' => 'L', 'М' => 'M', 'Н' => 'N',
	 
	'О' => 'O', 'П' => 'P', 'Р' => 'R', 'С' => 'S', 'Т' => 'T', 'У' => 'U',
	 
	'Ф' => 'F', 'Х' => 'H', 'Ц' => 'C', 'Ч' => 'Ch', 'Ш' => 'Sh', 'Щ' => 'Sch',
	 
	'Ь' => '', 'Ы' => 'Y', 'Ъ' => '', 'Э' => 'E', 'Ю' => 'Yu', 'Я' => 'Ya', 

	' ' => '-', '-' => '-', '–' => '-', '(' => '', ')' => '', '.' => '', 

	',' => '', '<' => '', '>' => '', '/' => '', '|' => '', '\\' => '',
	
	'_' => '-', '&' => '-and-', '"' => '', ':' => '', '!' => '','?' => '',

	'$' => '','^' => '',"'" => '','«' => '','»' =>'','<wbr>' =>'', '`' => '',

    '%' => '', '#' => '', '&quot;' => '');
	 
		return strtolower( strtr($string, $converter) );	
	}
	
	
	function __destruct() {
	}

}
/*function translit($insert) 
	{ 
		//setlocale (LC_ALL, 'ru_RU.CP1251');
		$insert = mb_strtolower($insert);    // Если работаем с юникодными строками
		$insert = iconv('UTF-8', 'cp1251', $insert);
		//$insert = strtolower($insert); // Все почему-то упорно переводят и заглавные и прописные, а потом делают strtolower Я сделал сразу, тем самым уменьшив массив
		$replase = array(
		// Буквы
		'а'=>'a',
		'б'=>'b',
		'в'=>'v',
		'г'=>'g',
		'д'=>'d',
		'е'=>'e',
		'ё'=>'yo',
		'ж'=>'zh',
		'з'=>'z',
		'и'=>'i',
		'й'=>'j',
		'к'=>'k',
		'л'=>'l',
		'м'=>'m',
		'н'=>'n',
		'о'=>'o',
		'п'=>'p',
		'р'=>'r',
		'с'=>'s',
		'т'=>'t',
		'у'=>'u',
		'ф'=>'f',
		'х'=>'h',
		'ц'=>'c',
		'ч'=>'ch',
		'ш'=>'sh',
		'щ'=>'shh',
		'ъ'=>'j',
		'ы'=>'y',
		'ь'=>'',
		'э'=>'e',
		'ю'=>'yu',
		'я'=>'ya',
		// Всякие знаки препинания и пробелы
		' '=>'-',
		' - '=>'-',
		'_'=>'-',
		//Удаляем
		'.'=>'',
		':'=>'',
		';'=>'',
		','=>'',
		'!'=>'',
		'?'=>'',
		'>'=>'',
		'<'=>'',
		'&'=>'',
		'*'=>'',
		'%'=>'',
		'$'=>'',
		'"'=>'',
		'\''=>'',
		'('=>'',
		')'=>'',
		'`'=>'',
		'+'=>'',
		'/'=>'',
		'\\'=>'',
		);
		$insert=preg_replace("/  +/"," ",$insert); // Удаляем лишние пробелы
		$insert = strtr($insert,$replase);
		return $insert;
	}*/
?>